function changeTab(tabNumber) {
    const display = document.getElementById("content");

    if(tabNumber === 1) {
        display.innerHTML = "<h3>Колгосп тварин</h3><p>Назва: Колгосп тварин</p><p>Автор: Джордж Орвелл</p><p>Рік видання: 1945</p><p>Жанр: Сатирична повість-притча</p><p>Опис: Сатирична алегорія на революцію 1917 року та подальші події. Тварини виганяють господаря-фермера, сподіваючись на свободу, але опиняються під диктатурою свині на ім'я Наполеон.</p>";
        display.style.backgroundColor = "#ffd4c8";
    }
    else if (tabNumber === 2) {
        display.innerHTML = "<h3>Володар мух</h3><p>Назва: Володар мух</p><p>Автор: Генрі Кітс</p><p>Рік видання: 1954</p><p>Жанр: Філософський роман, алегорія</p><p>Опис: Група вихованих англійських хлопчиків опиняється на безлюдному острові після авіакатастрофи. Історія про те, як швидко зникає цивілізованість і прокидається первісна жорстокість.</p>";
        display.style.backgroundColor = "#ffd4c8";
    }
    else if (tabNumber === 3) {
        display.innerHTML = "<h3>Портрет Доріана Грея</h3><p>Назва: Портрет Доріана Грея</p><p>Автор: Оскар Вайлд</p><p>Рік видання: 1890</p><p>Жанр: Готичний роман</p><p>Опис: Роман розповідає про молодого чоловіка, який бажає залишатися вічно молодим і красивим. Він продає свою душу, щоб його портрет старів замість нього, але з часом він виявляє, що його бажання має страшні наслідки.</p>";
        display.style.backgroundColor = "#ffd4c8";
    }
    else if (tabNumber === 4) {
        display.innerHTML = "<h3>Гордість і упередження</h3><p>Назва: Гордість і упередження</p><p>Автор: Джейн Остін</p><p>Рік видання: 1813</p><p>Жанр: Романтичний роман</p><p>Опис: Роман розповідає про життя та кохання родини Беннет, особливо про стосунки між Елізабет Беннет та містером Дарсі. Це історія про гордість, упередження та соціальні класи в Англії 19 століття.</p>";
        display.style.backgroundColor = "#ffd4c8";
    }
    else if (tabNumber === 5) {
        display.innerHTML = "<h3>І не лишилось жодного</h3><p>Назва: І не лишилось жодного</p><p>Автор: Агата Крісті</p><p>Рік видання: 1939</p><p>Жанр: Психологічний детективний роман</p><p>Опис: Найвідоміший детектив Агати Крісті. Десять незнайомців запрошені на острів, де їх один за одним наздоганяє покарання за минулі злочини згідно з дитячою лічилкою.</p>";
        display.style.backgroundColor = "#ffd4c8";
    }
}